/* 
【任务描述】
使用 C++ 实现桌面助手，至少具备三个功能，功能包括但不局限于下列选项（可以自行扩展 功能）：
1.记账本，记录日常收入和开销，包括分门别类按照周期进行统计及展示；(√)
2. 课程备忘录，记录上课的课表，课程提醒，作业ddl提醒，以及其他课程学习相关事务的管理；(√)
3.工作记录器，类似于日程管理软件或番茄时钟之类，用于记录自己的学习时间，地点，内容等；
4.密码记录器，记录自己常用的账号及密码信息等，查询的时候注意隐私保护和处理；（√）
5.生活轨迹生成器，能够根据的图片，文档等相关日期信息，按时间排序，自动搜寻导入相关的数据，排序，摘出其日期信息，并按其类型，生成一个填入模板，让用户只要填很少的文字就可以
简单记录一天，用户也可以根据需要进行选择，只保留重要的图片或者文档等信息。
【基本要求】
1. 以上述功能为基础，设计所需的数据结构、程序功能等，可以根据需要扩展所需功能。
2. 程序运行过程中，有方便合理的用户操作界面，能直观展示输入数据、处理过程及输出结果。
3. 各种数据可以存储在数据库或数据文件中，数据结构、具体数据项自定。 
*/